Зарплата_и_Управление_Персоналом_демо/src/InformationRegisters/НастройкиВзаимодействияСФедеральнымиМедрегистрами/НастройкиВзаимодействияСФедеральнымиМедрегистрами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиВзаимодействияСФедеральнымиМедрегистрами</name>
  <resources>
    <name>СпособПодключения</name>
    <type>
      <types>EnumRef.СпособыПодключенияКФедеральнымМедрегистрам</types>
    </type>
  </resources>
  <resources>
    <name>АдресСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресСервиса1СМедицинаРегион</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресСервиса1СЕГИСЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПилотныйПроектПоЗП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьАвтосопоставление1СЕГИСЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИспользовать1СМедицинаРегион</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИспользоватьТестовыйСервис</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьАдресТестовогоСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьАдресТестовогоСервиса1СМедицинаРегион</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

Зарплата_и_Управление_Персоналом_демо/src/Enums/СпособыПодключенияКФедеральнымМедрегистрам/СпособыПодключенияКФедеральнымМедрегистрам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПодключенияКФедеральнымМедрегистрам</name>
  <enumValues>
    <name>ИПС</name>
  </enumValues>
  <enumValues>
    <name>РегионСервис1С</name>
  </enumValues>
  <enumValues>
    <name>РегионЛокальный</name>
  </enumValues>
</mdclass:Enum>

Зарплата_и_Управление_Персоналом_демо/src/InformationRegisters/НастройкиВзаимодействияСФедеральнымиМедрегистрами/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ОбновитьПараметрыНастроекМедрегистров(ПараметрыОбновления = Неопределено) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("РаботаВМедицинскомУчреждении") Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НастройкиВзаимодействияСФедеральнымиМедрегистрами.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать(); 
	Если НаборЗаписей.Количество() = 0 Тогда 
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Запись.СпособПодключения) Тогда 
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
		
	Запись.СпособПодключения = ?(Запись.УдалитьИспользовать1СМедицинаРегион,
								Перечисления.СпособыПодключенияКФедеральнымМедрегистрам.РегионЛокальный,
								Перечисления.СпособыПодключенияКФедеральнымМедрегистрам.ИПС);
	Если Запись.УдалитьИспользоватьТестовыйСервис Тогда 
		Запись.АдресСервиса = Запись.УдалитьАдресТестовогоСервиса;
		Запись.АдресСервиса1СМедицинаРегион = Запись.УдалитьАдресТестовогоСервиса1СМедицинаРегион;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
